
#Область Служебные_функции_и_процедуры

&НаКлиенте
// контекст фреймворка Vanessa-Behavior
Перем Ванесса;
 
&НаКлиенте
// Структура, в которой хранится состояние сценария между выполнением шагов. Очищается перед выполнением каждого сценария.
Перем Контекст Экспорт;
 
&НаКлиенте
// Структура, в которой можно хранить служебные данные между запусками сценариев. Существует, пока открыта форма Vanessa-Behavior.
Перем КонтекстСохраняемый Экспорт;

&НаКлиенте
// Функция экспортирует список шагов, которые реализованы в данной внешней обработке.
Функция ПолучитьСписокТестов(КонтекстФреймворкаBDD) Экспорт
	Ванесса = КонтекстФреймворкаBDD;
	
	ВсеТесты = Новый Массив;

	//описание параметров
	//Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,Снипет,ИмяПроцедуры,ПредставлениеТеста,ОписаниеШага,ТипШага,Транзакция,Параметр);

	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"_()","_","Дано","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ПоступилаЕрунда()","ПоступилаЕрунда","Дано: Поступила ерунда","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"КогдаЯЕеОбрабатываю()","КогдаЯЕеОбрабатываю","Когда Когда я ее обрабатываю","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ЯФормируюФичаФайл()","ЯФормируюФичаФайл","Тогда я формирую фича файл","","");
	Ванесса.ДобавитьШагВМассивТестов(ВсеТесты,"ТолькоПотомНачинаюРазрабатывать()","ТолькоПотомНачинаюРазрабатывать","И Только потом начинаю разрабатывать","","");

	Возврат ВсеТесты;
КонецФункции
	
&НаСервере
// Служебная функция.
Функция ПолучитьМакетСервер(ИмяМакета)
	ОбъектСервер = РеквизитФормыВЗначение("Объект");
	Возврат ОбъектСервер.ПолучитьМакет(ИмяМакета);
КонецФункции
	
&НаКлиенте
// Служебная функция для подключения библиотеки создания fixtures.
Функция ПолучитьМакетОбработки(ИмяМакета) Экспорт
	Возврат ПолучитьМакетСервер(ИмяМакета);
КонецФункции

#КонецОбласти



#Область Работа_со_сценариями

&НаКлиенте
// Процедура выполняется перед началом каждого сценария
Процедура ПередНачаломСценария() Экспорт
	
КонецПроцедуры

&НаКлиенте
// Процедура выполняется перед окончанием каждого сценария
Процедура ПередОкончаниемСценария() Экспорт
	
КонецПроцедуры

#КонецОбласти


///////////////////////////////////////////////////
//Реализация шагов
///////////////////////////////////////////////////

&НаКлиенте
//Дано
//@_()
Процедура _() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Дано: Поступила ерунда
//@ПоступилаЕрунда()
Процедура ПоступилаЕрунда() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	//ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Когда Когда я ее обрабатываю
//@КогдаЯЕеОбрабатываю()
Процедура КогдаЯЕеОбрабатываю() Экспорт
	//Сообщить("")
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	//ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//Тогда я формирую фича файл
//@ЯФормируюФичаФайл()
Процедура ЯФормируюФичаФайл() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры

&НаКлиенте
//И Только потом начинаю разрабатывать
//@ТолькоПотомНачинаюРазрабатывать()
Процедура ТолькоПотомНачинаюРазрабатывать() Экспорт
	//Ванесса.ПосмотретьЗначение(Парам01,Истина);
	ВызватьИсключение "Не реализовано.";
КонецПроцедуры
